# Реализовать программу использующую генераторы, и обрабатывающую данные последовательно с использованием итераторов

# numbers = iter(range(1, 1000001))
# print(2000 in numbers)
# print(next(numbers) == 2001)
#

class Stack():

    def create_stack(self):
        stack = [i for i in range(1, 11)]
        index = len(stack) - 1
        for index in stack:
            stack[index].
            print(*stack)


x = Stack()
x.create_stack()


